; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   purple_door_1 - door
   empty - empty_0
   green_box_1 - box
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (when (not (locked purple_door_1)) (hold_0)) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (when (not (locked purple_door_1)) (hold_0)) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (or (not (locked purple_door_1)) (= ?door purple_door_1)) (hold_0)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (not (locked purple_door_1)) (hold_0)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (or (= ?obj green_box_1) (carrying green_box_1)) (hold_1)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (or (not (or (and (not (locked ?door)) (= ?door purple_door_1)) (and (locked purple_door_1) (not (and (locked ?door) (= ?door purple_door_1)))))) (at_ purple_door_1)) (hold_0)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   green_door_1 red_door_1 blue_door_1 - door
   yellow_ball_1 blue_ball_2 blue_ball_1 - ball
   yellow_box_1 yellow_box_2 grey_box_1 green_box_2 - box
 )
 (:init (agentinroom room_2) (objectinroom yellow_box_1 room_1) (objectinroom green_box_1 room_2) (objectinroom yellow_ball_1 room_2) (objectinroom blue_ball_1 room_2) (objectinroom grey_box_1 room_3) (objectinroom blue_ball_2 room_3) (objectinroom green_box_2 room_4) (objectinroom yellow_box_2 room_4) (objectcolor yellow_box_1 yellowtype) (objectcolor green_box_1 greentype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_ball_1 bluetype) (objectcolor grey_box_1 greytype) (objectcolor blue_ball_2 bluetype) (objectcolor green_box_2 greentype) (objectcolor yellow_box_2 yellowtype) (objectcolor green_door_1 greentype) (objectcolor red_door_1 redtype) (objectcolor purple_door_1 purpletype) (objectcolor blue_door_1 bluetype) (emptyhands) (locked green_door_1) (locked red_door_1) (locked purple_door_1) (locked blue_door_1) (adjacentrooms room_2 room_1 green_door_1) (adjacentrooms room_1 room_2 green_door_1) (adjacentrooms room_3 room_1 red_door_1) (adjacentrooms room_1 room_3 red_door_1) (adjacentrooms room_4 room_2 purple_door_1) (adjacentrooms room_2 room_4 purple_door_1) (adjacentrooms room_4 room_3 blue_door_1) (adjacentrooms room_3 room_4 blue_door_1) (visited room_2) (= (total-cost) 0))
 (:goal (and (exists (?v - box)
 (and (objectcolor ?v greytype) (objectinroom ?v room_3) (agentinroom room_3) (at_ ?v))) (hold_0) (hold_1)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor purple_door_1 room_2 room_4)
   added: (at_ purple_door_1) (hold_0)
   goals met: 1 of 3
2. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 1 of 3
3. (gotoobject green_box_1 room_2)
   deleted: (at_ purple_door_1)
   added: (at_ green_box_1)
   goals met: 1 of 3
4. (pick green_box_1 room_2)
   deleted: (at_ green_box_1) (emptyhands) (objectinroom green_box_1 room_2)
   added: (carrying green_box_1) (hold_1)
   goals met: 2 of 3
5. (gotoroom room_2 room_4 purple_door_1)
   deleted: (agentinroom room_2)
   added: (agentinroom room_4) (visited room_4)
   goals met: 2 of 3
6. (gotodoor blue_door_1 room_4 room_3)
   added: (at_ blue_door_1)
   goals met: 2 of 3
7. (toggle blue_door_1)
   deleted: (locked blue_door_1)
   goals met: 2 of 3
8. (gotoroom room_4 room_3 blue_door_1)
   deleted: (agentinroom room_4) (at_ blue_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 2 of 3
9. (gotoobject grey_box_1 room_3)
   added: (at_ grey_box_1)
   goals met: 3 of 3
